app/controllers/purchases_controller.rb

SELECT "purchases".* FROM "purchases"
---
  def index
    @purchases = Purchase.all

DELETE FROM "purchases" WHERE "purchases"."id" = ?  [["id", 1]]
---
  def destroy
    @purchase.destroy

SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT 1  [["id", "1"]]
---
  def set_purchase
    @purchase = Purchase.find(params[:id])